export default {
  code: "ms",
  name: "ملايو جاوي",
  alfaType: "Jawi",
  auth: {
    alert: {
      desc: "كود اوتڤ تله دهانتر ك ايميل اندا",
      btn: "توتوڤ"
    },
    tabs: ["ماسوق", "دفتر"],
    button: [
      "لوڤا كات لالوان؟",
      "ماسوق",
      "دفتر",
      "هنتر",
      "سهكن",
      "اوبه",
      "ماسوقان كود اوتڤ اندا"
    ],
    title: ["لوڤا كات لالوان", "ڤڠصحن", "ۏيريفيچاتياون"],
    textInput: {
      username: "نام ڤڠڬونا",
      password: "كات لالوان",
      repassword: "اولڠ كات لالوان",
      email: "ايميل",
      otpCode: "كود اوتڤ"
    },
    error: {
      require: text => `${text}  مستي دايسي`,
      min: (text, limit) => `مينيموم ${limit} حروف دڤرلوكن`,
      validEmail: () => "فورمت ايميل تيدق بتول",
      sameValue: text => `${text} اتيدق سام`,
      incorrect: text => `${text} تيدق بتول`,
      network: () => `ڬاڬل مڽمبوڠ ك اينترنيت`,
      taken: text => `${text} تله ددفتركن`,
      notFound: text => `${text} تيدق دجومڤأي`,
      server: () => `معاف، اد يڠ ساله`
    }
  },
  home: {
    button: ["ماءينكن ۏيديو", "بلاجر", "كويز", "سورة٢ ڤيليهن", "بلاجر هجاءية"]
  },
  setPopUp: {
    title: ["تتڤن", "بهاس"],
    button: [
      "توكر ڤروفيل",
      "مڠناءي كامي",
      "ڤماجو",
      "ڤڽوكوڠ",
      "سوكوڠ كامي",
      "كلوار"
    ]
  },
  langPopUp: "ڤيليه بهاس",
  editProfile: {
    title: "توكر ڤروفيل",
    subTitle: ["نام ڤڠڬونا", "ايميل"]
  },
  editProfile: {
    title: "توكر ڤروفيل",
    subTitle: ["نام ڤڠڬونا", "ايميل"],
    popUpTitle: ["نام ڤنوه", "توكر كات لالوان"],
    fullName: "نام ڤنوه",
    password: "كات لالوان",
    textInput: {
      firstName: "نام ڤرتام",
      lastName: "نام تراخير",
      newPassword: "كات لالوان بهارو",
      confirmPassword: "سهكن كات لالوان"
    },
    submitBtn: "سلساي"
  },
  changeImgPopUp: {
    title: "ڤيليهن",
    button: ["امبيل فوتو", "ڤيليه دري ڤوستاك"]
  },
  learn: {
    title: "ستروسڽ",
    button: ["ماءينكن ۏيديو", "موات تورون", "كڬماران", "كويز"]
  },
  practice: {
    button: ["هنتر", "ستروسڽ", "چوبا لاڬي", "سلساي"],
    error: "جواڤنڽ لبيه درڤد ساتو",
    options: ["ا.", "ب.", "ج.", "د."],
    alert: [
      {
        title: "كويز تيدق ترسديا!",
        desc: "تاجوق اين تيدق ممڤوڽا ءي سبارڠ كويز"
      },
      {
        title: "امارن!",
        desc: "جواڤن اندا تيدق اكن دسيمڤن، ادكه اندا ڤستي ايڠين برهنتي؟"
      },
      {
        title: "ۏيدياو تيدق ترسديا!",
        desc: "كويز اين تيدق ممڤوڽاءي ۏيدياو"
      }
    ],
    result: {
      title: status => (status ? "ماري چوبا لاڬي!" : "تهنيئه!"),
      content: (correct, total) =>
        `اندا منداڤتكن ${correct} دري ${total} جواڤن يڠ بتول`
    }
  },
  hijaiyahPlay: {
    alert: [
      {
        title: "امارن!",
        desc: "سكور اندا تيدق اكن دسيمڤن، ادكه اندا ڤستي ايڠين برهنتي؟",
        cancleBtn: "تيدق",
        confirmBtn: "يا"
      }
    ]
  },
  surah: {
    tabs: ["ڤيليه سورة", "دڠن كات"],
    alert: {
      title: "امارن!",
      desc: "اءوديو اكن برهنتي، ادكه اندا ڤستي ايڠين كلوار؟",
      btn: ["يا", "تيدق"]
    }
  },
  other: ["ڤيليه تاهڤ", "چاري تاهڤ", "ڤيليه سورة", "چاري سورة", "ڤيليه سورة"],
  iqra: {
    help: {
      hijaiyah: `حجاءييه اتاو ابجد عرب اداله ايجأن بهاس عرب يڠ دكوديفيكاسيكن اونتوق منوليس دالم بهاس عرب، اي دتوليس دري كانن ك كيري دڠن ڬاي سمبوڠن ترتوليس دان ممڤوڽاءي 28 حروف.`,
      harakat: [
        `حراكت اداله تندا باچ يڠ دتمڤتكن ڤد حروف عرب اونتوق ممڤرموده ممباچ حروف عرب.`,
        `ڬاريس ڤڤنجورو كچيل دلتقكن د اتس حروف بوليه دباچ "ا".`,
        `ڬاريس ڤڤنجورو كچيل دلتقكن د باوه حروف بوليه دباچ "ا".`,
        `سڤرتي حروف واوو كچيل دلتقكن د اتس حروف بوليه دباچ "او".`
      ],
      tanwin: [
        `تنوين اداله تندا باچ دالم بهاس عرب اونتوق مڽاتاكن بهاوا حروف داوچڤكن يڠ بيرقهير دڠن حروف "نون" ماتي.`,
        `اين بوليه دباچ "-ان".`,
        `اين بوليه دباچ "-ين".`,
        `اين بوليه دباچ "-اون".`
      ]
    }
  },
  play: {
    score: "سكور",
    highScore: "سكور ترتيڠڬي",
    help: {
      hijaiyah1: `ڤيليه حجاءييه دري د باوه ڤانل يڠ سروڤا دڠن يڠ د اتس.`,
      hijaiyah2: `ڤيليه حجاءييه مڠيكوت اڤ يڠ اندا دڠر.`,
      harokat1: `ڤيليه هراوكت يڠ بنر كڤد اڤ يڠ تله اندا دڠر.`,
      harokat2: `ڤيليه حجاءييه دان هراوكت يڠ اداله بنر سسواي دڠن اڤ يڠ تله اندا دڠر.`,
      tanwin1: `ڤيليه تنوين يڠ بتول-بتول ايڤدان دڠن اڤ يڠ تله اندا دڠر.`,
      tanwin2: `ڤيليه حجاءييه دان تنوين بتول سسواي دڠن اڤ يڠ تله اندا دڠر.`
    }
  },
  errorNetwork: {
    title: "امارن!",
    btn: "اوق",
    desc: `ڬاڬل مڽمبوڠ ك اينترنيت, \nمڽمق سمبوڠن اندا`
  },
  darjahName: ["درجه ڤرا", "درجه I", "درجه II", "درجه III", "درجه IV", "درجه V", "درجه VI"],
  downloadVideo: {
    addToFav: {
      title: "تمبه ك كڬماران",
      btn: "توتوڤ",
      desc: `برجاي دتمبه ك سناراي كڬماران`
    },
    errAddToFav: {
      title: "امارن!",
      btn: "توتوڤ",
      desc: `اندا تله منمبه سناراي كڬماران`
    },
    downloading: {
      title: "مموات تورون",
      btn: "مموات تورون"
    },
    downloadExist: {
      title: "مموات تورون!",
      btn: "مموات تورون",
      desc: `مموات تورون`
    }
  }
}
